projectSurfEnvToCurve(Surface!System.Runtime.CompilerServices.IsConst*,Plane!System.Runtime.CompilerServices.IsConst*,Owner&lt;GCurve&gt;*,Envelope*)
Given a surface that is perpendicular to a certain plane, determine the curve obtained by
projecting the surface's envelope (or pEnv if it is not null) onto the plane.
Input:
pSurface, pPlane: the surface and the plane onto which the surface's envelope should be
projected. The surface must be perpendicular to the plane.
Optional input: pEnv; if provided, this will be used instead of the surface's envelope.
Output:
pCurve: the bounded curve obtained by projecting the envelope onto the plane.
The curve's direction is arbitrary. No curve is returned if an error occurs.
Returns: ERR_SUCCESS if successful, ERR_FAILURE or other values if not. If the surface is
not perpendicular to the plane, no curve will be constructed and ERR_FAILURE will be
returned.
Note: At present, this routine is used for surface with coordinate systems that are "aligned"
with the plane (e.g., a vertically extruded surface and a horizontal plane). The API and/or
implementation may need to be changed if the usage is broadened.